/************************     הוראות חשובות      ***********************/

/**
 
 1.   במידה וזאת פעם ראשונה שלכם ממלאים תוכן בלומדה, קראו את **קובץ הוורד** המצורף בתקייה
 2.   בעמוד זה יש למלא את הפרטים לגבי כל המידע והתוכן המבוקש
 3.   [amountOfQuestions במשתנה] לשים לב שבכל נושא צריך לכתוב את *כמות השאלות המקסימלית* שתלקח ממנו
      **משתנה זה מתייחס רק לשאלות שיילקחו בשביל **המבחן
 */


/************************      הכנס כותרת ראשית שהיא שם הלומדה      ***********************/
const TITLE = `פק"ל שגרה דיגיטלי בה"ד 7`;

/************************      הכנס כמות זמן התחלתית של המבחן      ***********************/
const TIME_FOR_EXAM = "7:00";

// אובייקט המכיל את כל המידע של הלומדה הכולל את התוכן, השאלות לכל נושא וכמות השאלות שיילקח מכל נושא למבחן
const DATA = {
    // שם נושא
    "נהלי היחידה": {
        "icon": "../assets/images/learning/Artboard 4.svg", // הכנס קישור של אייקון
        // שאלות לנושא הזה
        "questions": [],
        "amountOfQuestions": 2,
        "learningContent": {
            "פינות עישון": {
                "הנחיות עבור פינות עישון:": [{
                        cardType: "listNumbers3",
                        numList: "5",
                        li1: `חל איסור מוחלט לעשן ברחבי הבה"ד למעט במקומות המסומנים לכך, בדגש על חדרי מגורים ומשרדים.`,
                        li2: `ככלל, מקומות העישון יוגדרו כפינות ישיבה ברחבי הבה"ד.`,
                        li3: `להלן פירוט מיקום פינות העישון בבה"ד :
                        <br> * ישיבה אזור המשרדים.
                        <br> * פינות ישיבה אזור מגורים.
                        <br> * פינת ישיבה באזור הכיתות.`,
                        li4: `חל איסור מוחלט להשליך בדלי סיגריות מחוץ למכלים המיועדים לאיסוף אשפה.`,
                        li5: `חייל שייתפס מעשן לא במקומות המוגדרים ייענש.`,
                    },
                    // {
                    //     cardType: "text",
                    //     content: "כאן ייכתב הרבה טקסט לפי השיעור או הקורס הנבחר. מומלץ לא לשים יותר מידי תוכן מיותר מאחר ויש הרבה כרטיסיות שצריך לזכור בסופו של דבר ולכן יש להיות תמציתיים! כאן ייכתב הרבה טקסט לפי השיעור או הקורס הנבחר. מומלץ לא לשים יותר מידי תוכן מיותר מאחר ויש הרבה כרטיסיות שצריך לזכור בסופו של דבר ולכן יש להיות תמציתיים! "
                    // },
                    // {
                    //     cardType: "textTwoParagraphs",
                    //     text1: "כאן ייכתב הרבה טקסט לפי השיעור או הקורס הנבחר. מומלץ לא לשים יותר מידי תוכן מיותר מאחר ויש הרבה כרטיסיות שצריך לזכור בסופו של דבר ולכן יש להיות תמציתיים! כאן ייכתב הרבה טקסט לפי השיעור או הקורס הנבחר. מומלץ לאיים! ",
                    //     text2: "כאן ייכתב הרבה טקסט לפי השיעור או הקורס הנבחר. מומלץ לא לשים יותר מידי תוכן מיותר מאחר ויש הרבה כרטיסיות שצריך לזכור בסופו של דבר ולכן יש להיות תמציתיים! כאן ייכתב הרבה טקסט לפי השיעור או הקורס הנבחר. מומלץ יות תמציתיים! "
                    // },
                    // {
                    //     cardType: "textThreeParagraphs",
                    //     text1: "כאן ייכתב הרבה טקסט לפי השיעור ן מהיות תמציתיים! ",
                    //     text2: "כאן ייכתב הרבה טקסט לפי השיעור או הקורס הנבחר. מומלץ לא לשים יותר מי הרבה כרטיסיות שצריך לזכור בסופו של דבר ולכן יש להיות תמציתיים! ",
                    //     text3: "כאן ייכתב הרבה טקסט לפי השיעור או הקורס הנבחר. מומלץ לא לשים יותר מידי תוכן מיותר מאחר ויש הרבה כרטיסיות שצריך לזכור בסופו של דבר ולכן יש להיות תמציתיים! כאן ייכתב הרבה טק להיות תמציתיים! "
                    // },
                    // {
                    //     cardType: "videoAndText",
                    //     video: "../assets/images/פתיח.mp4",
                    //     content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
                    // }
                    // ],
                    // "תת תת נושא 2": [{
                    //     cardType: "twoPics",
                    //     pic1: "../assets/images/pic.png",
                    //     content1: "דוגמה לכותרת לתמונה הראשונה",
                    //     pic2: "../assets/images/pic.png",
                    //     content2: "דוגמה לכותרת לתמונה השנייה"
                    // }],
                    // 'תרופה לבה"ד 10': [{
                    //         cardType: "pic_4titles_4text",
                    //         pic: "../assets/images/pic.png",
                    //         subTitle1: "מה הסכנות?",
                    //         content1: "סכנה גדולה מאוד",
                    //         subTitle2: "מה היתרונות?",
                    //         content2: "זה יכול להכיל מלא מלא יתרונות, במיוחד כאלה ארוכים במיוחד כדי להראות איך נכנס פה הרבה טקסט. מקווה שאהבתם את הלומדה תודה רבה שלום.",
                    //         subTitle3: "מי קהל היעד?",
                    //         content3: "אין קהל יעד. תרקדו",
                    //         subTitle4: "אין לי רעיון לעוד כותרת",
                    //         content4: "חבל מאוד אז סתם נזרוק פה תוכן שיראה כאילו יש פה תוכן אבל לא באמת...",
                    //     },
                    //     {
                    //         cardType: "_3titles_3text",
                    //         subTitle1: "מה הסכנות?",
                    //         content1: "סכנה גדולה מאוד",
                    //         subTitle2: "מה היתרונות?",
                    //         content2: "זה יכול להכיל מלא מלא יתרונות, במיוחד כאלה ארוכים במיוחד כדי להראות איך נכנס פה הרבה טקסט. מקווה שאהבתם את הלומדה תודה רבה שלום.",
                    //         subTitle3: "מי קהל היעד?",
                    //         content3: "אין קהל יעד. תרקדו",
                    //     },

                ],
            },
            // "תיבת פניות למפקד": {
            //     "הנחיות עבור פניות למפקד:": [{
            //             cardType: "listNumbers3",
            //             numList: "7",
            //             li1: `בכפוף לפ.מ.35.0822, בכל יחידות צה"ל תוצב "תיבת פניות". באמצעותה יוכלו חיילי היחידה לפנות בכתב למפקד הבה"ד, שלא באמצעות מפקדיו הישיר.`,
            //             li2: `מיקום התיבה – צמוד לדלת כניסה הראשית של בניין 706.`,
            //             li3: `תיבה זו תהיה נעולה באופן קבוע.`,
            //             li4: `התיבה תרוקן כל יום בשעה 10:00 ע"י פקידות הלשכה.`,
            //             li5: `תוכן התיבה יימסר ישירות למפקד הבה"ד.`,
            //             li6: `מפקד הבה"ד יתייחס לפניות שבתיבה, בכל דרך שימצא לנכון, מרגע קבלתן בהתאם לכתוב בפ.מ 35.0822.`,
            //             li7: `פניית חייל למפקד דרך תיבת הפניות לא תפגע בזכות החייל לפנות למפקדיו בצינורות הפיקוד המקובלים בהתאם לכתוב בפ.מ 35.0822. `,
            //         },
            //         // "תת תת נושא 25": [{
            //         //     cardType: "videoAndText",
            //         //     video: "../assets/images/פתיח.mp4",
            //         //     content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
            //         // }],
            //         // "תת תת נושא 42": [{
            //         //     cardType: "text",
            //         //     content: "מלא מילים של נושא ספיציפי, שנראה לי שייצא יפה אבל בואו נגלה יחדיו!"
            //         //     // }]
            //         // ],
            //         // "תת נושא 4": {
            //         //     "תת תת נושא 12": [{
            //         //         cardType: "videoAndText",
            //         //         video: "../assets/images/פתיח.mp4",
            //         //         content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
            //         //     }],
            //         //     "תת תת נושא 23": [{
            //         //             cardType: "listNumbers3",
            //         //             numList: "4",
            //         //             li1: `אחת לחודש יופץ דוח המפרט סטאטוס ניצול חופשה שנתית בהתאם לתוכנית כפי שאושרה ע"י  מפקד היחידה.`,
            //         //             li2: `אחת  לשבוע  רמ"ד משא"ן יפיץ דוח קצינים / נגדים אשר שהוו בחופשה באותו שבוע (דוח סגירת שבוע)  באחריות רע"נים לאשרר את הדוח במייל חוזר.`,
            //         //             li3: `איש קבע הנמצא בחופשת אבל/ לידה  יעביר אסמכתא לרמ"ד משא"ן, באם לא יועבר  אישור רלוונטי, יום זה יומר לחופשה שנתית.`,
            //         //             li4: `מחלה/ מחלת ילד/ הורה/בן זוג  באם לא תועבר אסמכתא , יבוצע תיקון אוטומטי ע"י המערכת וימי היעדרות ירדו ממניין ימי החופשה שנתית.`,
            //         //         },
            //         //         {
            //         //             cardType: "listNumbers3",
            //         //             numList: "4",
            //         //             subTitle: "כותרת לרשימה:",
            //         //             li1: "משפט ראשון ברשימה, זה לדוגמה משט יחסית ארוך משאר המשפטים ויש נקודה בסוף המשפט.",
            //         //             li2: "משפט שני ברשימה",
            //         //             li3: "משפט שלישי ברשימה",
            //         //             li4: "משפט שלישי ברשימה",
            //         //         }
            //         //     ]
            //         // },
            //         // "תת נושא 5": {
            //         //     "תת תת נושא 12": [{
            //         //         cardType: "videoAndText",
            //         //         video: "../assets/images/פתיח.mp4",
            //         //         content: "סרטון מוסר שלא הבנתי למה הוא היה על המחשב של פלג... פטל.. שלג?"
            //         //     }],
            //         // "תת תת נושא 23": [
            //         //     {
            //         //         cardType: "twoPics",
            //         //         pic1: "../assets/images/Artboard 1 copy 2@2x.png",
            //         //         content1: "זה דוגמה לתמונה מוצלחת ראשונה",
            //         //         // subTitle1: "זה דוגמה לתמונה מוצלחת ראשונה",
            //         //         pic2: "../assets/images/Artboard 1 copy 2@2x.png",
            //         //         content2: "זה דוגמה לתמונה מוצלחת שנייה"
            //         //         // subTitle2: "זה דוגמה לתמונה מוצלחת שנייה"
            //         //     }
            //     ]
            // },
            "מרותקים": {
                "הנחיות עבור נוהל מרותקים:": [{
                    cardType: "listNumbers3",
                    numList: "14",
                    li1: `חייל מרותק פירושו- מרותק למחנה לתקופה המופיעה בפסק הדין.`,
                    li2: `רס"ר הבה"ד ינהל טופס התייצבות מרותקים ויתויק בתיק קצין תורן.`,
                    li3: `במהלך העברת תדרוך משמרת תורנית, יתדרך הרס"ר את הקצין תורן באם ישנם מרותקים.`,
                    li4: `קצין התורן יקבל בכל תדרוך קלסר מרותקים.`,
                    li5: `הקצין תורן יחתום רק במידה והחיילת אכן הגיעה אליו כמפורט הנוהל זה.`,
                    li6: `במידה והחייל לא הגיע לחתום על טופס המרותקים על הקצין תורן ליצור קשר עם מפקדו של החייל אשר רשום בטופס הריתוק.`,
                    li7: `הנ"ל יתייצב בפני הקצין תורן כל שעה החל מ-18:00 עד שעה 22:00 ו7:00 בבוקר למחרת כולל.`,
                    li8: `הקצין תורן יחתום בדף מרותקים בכל שעה שבה החייל התייצב.`,
                    li9: `בדיקת מרותקים וחתימה על טופס מרותקים יתקיים במבנה 706 ליד השומר או על פי הגדרת הקצין תורן.`,
                    li10: `התייצבות במדים בלבד.`,
                    li11: `בשעה 7:00 ביום למחרת יתייצב בפני הקצין תורן בפעם האחרונה לאותה משמרת.`,
                    li12: `חל איסור מוחלט לשחרר חייל מרותק מהתייצבות או מעבודות שהוטלו עליו.`,
                    li13: `הקצין תורן ידווח ויחזיר את קלסר המרותקים לרס"ר הבה"ד כל בוקר עד 8:00. בימי א עד השעה 9:00.`,
                    li14: `קצין תורן אשר לא יעמוד בהנחיות אלו יזומן לבירור.`,
                }, ],

                "מטרה:": [{
                    cardType: "text",
                    content: `מעקב אחר החייל המרותק.`,
                }, ]
            },
            'מסדרי רס"ר הבה"ד': {
                'הנחיות עבור מסדרי רס"ר הבה"ד:': [{
                        cardType: "listNumbers3",
                        numList: "6",
                        li1: `המסדרים יתקיימו במתכונת הבאה של מסדרי הנפה במגרש המסדרים, ומסדרים במגורים.`,
                        li2: `המסדרים יתקיימו על פי הפקודות והנחיות הקורונה.`,
                        li3: `רס"ר הבה"ד יקיים מסדרי הנפה למטה הבה"ד/ ענף מפקדים/ ענף הדרכה/ ב"מ/ משא"ן, סיוג מהמסדר יאושר רק ע"י רס"ר הבה"ד יום לפני המסדר.`,
                        li4: `רס"רית הכשרות היסוד תקיים מסדרי הנפה לענף הכשרות היסוד, סיוג מהמסדר יאושר רק ע"י רס"רית הכשרות היסוד יום לפני המסדר.`,
                        li5: `מסדר מגורים אין צורך בסיוג, יעמוד נציג מכל חדר לאחר שכל התורנויות מבוצעות.`,
                        li6: `סגל אשר לא יעמוד למסדר הנפה/ מגורים ללא אישור הח"מ ייענש בחומרה.`,
                    },
                    {
                        cardType: "textTwoParagraphs",
                        text1: `<b><u>יום שני</u></b>`,
                        text2: `<ol class="list">
                        <u>מסדר:</u> מסדר הנפה כלל בה"ד7.
                        <br><br><u>הערות:</u> במגרש 707 בשעה 8:00 יתקיים המסדר להכשרות היסוד. במגרש 204 בשעה 8:00 יתקיים המסדר למטה הבה"ד/ ענף מפקדים/ ענף הדרכה/ ב"מ/ משא"ן.
                        <br><br>אין סיוגים.
                        <br><br>במסדר ייבדק דיגום הופעה ולבוש, פק"ל כיסים פטורים במידה וקיימים. והודעות להמשך השבוע.</ol>`,
                    },
                    {
                        cardType: "textTwoParagraphs",
                        text1: `<b><u>יום שלישי</u></b>`,
                        text2: `<ol class="list">
                        <u>מסדר:</u> מסדר מגורים כלל בה"ד7, כולל קצינים ונגדים.
                        <br><br><u>הערות:</u>המסדר יתקיים בשעה 8:00 במגורי סגל הבה"ד (בנים/בנות).
                        <br>במסדר ייבדק ניקיון החדרים וכלל המבנה. לפני כל מסדר תישלח טבלת תורנויות לניקיון המבנה, כל מפקדת/ מ"מ אחראית על ווידוא הניקיון של החיילים שלה.
                        <br>במסדר ייבדק פורמטים מעודכנים על דלתות וארוניות, ארוניות מסודרות, שטיפת חדר מלאה וניקיון אבק, וסידור חדר לפי הפורמט. במסדר נדרש נציג על החדר לאחר שהתורנות מבנה כבר עומדת למסדר. 
                        <br><br>אין חדר שלא עומד ואין חדר שלם שמסויג.</ol>`,
                    },
                    {
                        cardType: "textTwoParagraphs",
                        text1: `<b><u>יום רביעי</u></b>`,
                        text2: `<ol class="list">
                        <u>מסדר:</u> מסדר הנפה כלל בה"ד7.
                        <br><br><u>הערות:</u> במגרש 707 בשעה 8:00 יתקיים המסדר להכשרות היסוד. במגרש 204 בשעה 8:00 יתקיים המסדר למטה הבה"ד/ ענף מפקדים/ ענף הדרכה/ ב"מ/ משא"ן.
                        <br><br>אין סיוגים.
                        <br><br>במסדר ייבדק דיגום הופעה ולבוש, פק"ל כיסים פטורים במידה וקיימים. והודעות להמשך השבוע.</ol>`,
                    },
                    {
                        cardType: "textTwoParagraphs",
                        text1: `<b><u>יום חמישי</u></b>`,
                        text2: `<ol class="list">
                        <u>מסדר:</u> מסדר הנפה כלל בה"ד7.
                        <br><br><u>הערות:</u> במגרש 707 בשעה 8:00 יתקיים המסדר להכשרות היסוד. במגרש 204 בשעה 8:00 יתקיים המסדר למטה הבה"ד/ ענף מפקדים/ ענף הדרכה/ ב"מ/ משא"ן.
                        <br><br>אין סיוגים.
                        <br><br>כלל החיילים מגיעים על מדי א' פרט לחיילים שסוגרים שבת בלבד! במסדר ייבדק דיגום הופעה ולבוש ופק"ל כיסים.</ol>`,
                    },
                    {
                        cardType: "picAndText",
                        title: 'מסדרי רס"ר הבה"ד',
                        pic: "../assets/images/מסדר רסר2.jpg",
                        content: ""
                    }
                ]
            },
            'תדריך יציאה': {
                'הנחיות כלליות:': [{
                    cardType: "listNumbers3",
                    numList: "5",
                    li1: `יש להיות זמינים במהלך כל חופשה בבית.`,
                    li2: `אין ללכת עם 2 אוזניות.`,
                    li3: `חציית כביש רק במעבר חצייה, אין חציית כביש ברמזור אדום להולכי רגל.`,
                    li4: `התייצבות בחזרה מהבית בשעה שמוגדרת.`,
                    li5: `לפני נסיעה לביקור רופא – יש לעדכן את המפקד/ת.`,
                }, ],

                'הנחיות עבור הופעה ולבוש:': [{
                    cardType: "textTwoParagraphs",
                    text1: `היציאה הביתה והחזרה מהבית לבסיס תתבצע באופן הבא`,
                    text2: `<ol class="list">
                    <li>מדי א' תקינים (ללא כתמים/ חורים) כומתה ותג יחידה.</li>
                    <li>נעליים מצוחצחות.</li>
                    <li>תספורת תקנית.</li>
                    <li>דסקית על הצוואר ובנעליים (נעלי בנים בלבד).</li>
                    <li>פק"לים.</li>
                    <li>פטורים – זקן/ שיער/ נעליים/ מדים (במידה ויש).</li></ol>`,
                }, ],

                'הנחיות עבור נשק:': [{
                    cardType: "listNumbers3",
                    numList: "2",
                    li1: `אין להוריד את הנשק במהלך כל נסיעה שהיא לא צבאית.`,
                    li2: `אין התעסקות עם הנשק בשהייה בבית.`,
                }, ],

                'הנחיות עבור חומר מסווג/ מידור:': [{
                    cardType: "listNumbers3",
                    numList: "1",
                    li1: `אין לדבר על כל נושא צבאי שיש לו רמת סיווג במקומות ציבוריים.`,
                }, ],

                'הנחיות עבור טרמפים:': [{
                    cardType: "listNumbers3",
                    numList: "3",
                    li1: `<b><u>חל איסור על נסיעה בטרמפים–</u></b>
                    איום החטיפה.`,
                    li2: `מלבד העובדה שנסיעה בטרמפים היא עבירה על פקודות הצבא.`,
                    li3: `אין לנסוע בטרמפים כל עוד חייל משרת בצבא – ז"א, אסורה נסיעה בטרמפים גם על אזרחי.`,
                }, ],

                'הנחיות עבור נהיגה:': [{
                    cardType: "listNumbers3",
                    numList: "3",
                    li1: `אין לעלות על ההגה לפני שינה – יש להקפיד לפחות על שבע שעות שינה.`,
                    li2: `אין לעלות על הגה במידה ושתינו אלכוהול.`,
                    li3: `הקפדה על חגורות בטיחות וכללי התנועה.`,
                }, ],

                'הנחיות עבור משטרה צבאית:': [{
                    cardType: "listNumbers3",
                    numList: "3",
                    li1: `חייל אשר ייתפס על ידי משטרה צבאית כאשר איננו מדוגם יקבל דוח מ"צ.`,
                    li2: `יש לנהוג בכבוד כלפי שוטר צבאי לא בורחים/נעלמים.`,
                    li3: `במידה וקיבלת דוח מ"צ יש לדווח במידי.`,
                }, ],

                'הקפצות:': [{
                    cardType: "textTwoParagraphs",
                    text1: `ישנן שתי סוגי הקפצות :`,
                    text2: `<ol class="list">
                    <li>הקפצה שקטה – הקפצה אשר תתבצע ע"י קשר טלפוני שיעבור ביניכם הקשר יתחיל ויסתיים אצל מפקדיכם.</li>
                    <li>הקפצה רועשת – הקפצה אשר מתבצעת ע"י קוד צבאי שהוא : "החידון לידיעת הארץ נדחה/ בוטל". ברגע שתשמעו קוד זה באחד מאמצעי התקשורת יהיה עליכם להגיע לבסיס.</li></ol>`,
                }, ]
            },
            'חבישת כומתה': {
                'הנחיות עבור חבישת כומתה:': [{
                        cardType: "listNumbers3",
                        numList: "4",
                        li1: `<u>חניכי הקורס-</u>
                        שנעים במדי ב' ינועו אך ורק עם כובע תקין עם סמל הבה"ד ועל מדי א' ינועו עם כומתה על הראש.`,
                        li2: `<u>מטה הבה"ד-</u>
                        כומתה על הראש על מדי א', כובע תקין עם סמל הבה"ד על מדי ב'.`,
                        li3: `<u>סגל הקורס-</u>
                        ינועו עם כובע אחיד לאותו בה"ד ועם כיתוב צבאי ראוי ומוגדר מראש על מדי ב' ועם כומתה על הראש על מדי א'.`,
                        li4: `<u>צוערים-</u>
                        ינועו עם כומתה על הראש על מדי א' ומדי ב'.
                        <br><br><b><u>חל איסור מוחלט על תנועה בשטחי הקרייה ללא כומתה.</u></b>`,
                    },
                    {
                        cardType: "textTwoParagraphs",
                        text1: `<u>אופן חבישה תקינה :</u>`,
                        text2: `<ol class="list">
                        <li>הכומתה תהיה בהתאם הנחיות בנושא בהק"א 01 - 05 - 33</li>
                        <li>איסור עשיית שינויים בכומתה, תג כומתה, רקע אדום וכו'.</li>
                        <li>הכומתה תהיה בגודל המתאים לראש החייל ותכסה את השיער עד קו המצח.</li>
                        <li>תג הכומתה (סגל) יהיה מעל עין שמאל.</li>
                        <li>כומתה תהיה משוכה לימין ולא בשום צורה אחרת</li>
                        <li>כל דרך אחרת של חבישת כומתה מלבד המפורט בסעיף הקודם אסורה בהחלט.</li>
                        <li>כלל החיילים והמפקדים יקיימו את הפקודות בנושא, הקפדה יתרה הדרכת החיילים בנושא מחייבת ובדגש על ההכשרות בבה"ד.</li></ol>`,
                    },
                    {
                        cardType: "picAndText",
                        title: 'חבישת כומתה',
                        content: "<u>אופן חבישה תקינה !</u>",
                        pic: "../assets/images/חבישת כומתה תקינה.jpeg"
                    }
                ]
            },
            "הופעה ולבוש בטקסים ואירועים": {
                "כללי:": [{
                    cardType: "textTwoParagraphs",
                    text1: `כידוע בצה"ל נערכים טקסים רבים ואירועים צבאיים המחייבים קוד הופעה ולבוש אחידים.`,
                    text2: `הוראת קבע אכ"א 33-13-04 "נוהג וטקס בצה"ל" עוסקת בטקסים הצבאיים על שלל תצורותיו.`,
                }, ],

                "הגדרות:": [{
                    cardType: "listNumbers3",
                    numList: "2",
                    li1: `<u>טקס/ אירוע-</u>
                    אירוע חגיגי המתקיים על מגרש מסדרים בהשתתפות קצינים וחיילים או באולם סגור במתכונת מצומצמת יותר. כל טקס הנערך במסגרת צבאית, כולל מסדרים, טקסי החלפות פיקוד, טקסי זיכרון והנצחה, משמרות כבוד, טקסי סיום קורסי, טקסי מצטיינים, טקסי הענקת דרגות, אזכרות צבאיות/ממלכתיות וכו'.`,
                    li2: `<u>חייל- </u>
                    איש צבא, חוגר או קצין, בשירות סדיר או בשירות מילואים.`,
                }, ],

                "הנחיות:": [{
                    cardType: "listNumbers3",
                    numList: "7",
                    li1: `ההנחיות המפורטות באיגרת זו נוגעות לטקס הנערך באולם או במקום פתוח.`,
                    li2: `ההנחיות תקפות לחיילים המהווים חלק מהכוח הטקסי ולאנשי צבא שלובשים מדים הנמצאים בקבל ואינם נוטלים חלק פעיל בטקס.`,
                    li3: `בטקסים ובאירועים יש להופיע במדי השירות (מדי א') בחולצה בעלת שרוולים ארוכים, כאשר השרוולים מורדים ומכופתרים.`,
                    li4: `בטקסים יש לחבוש כומתה או כובע קצינים במשך כל הטקס (למעט אם הטקס נערך באולם סגור ומקורה).`,
                    li5: `לפני הגעה לטקס או לאירוע יש לוודא צחצוח נעליים (המשתתפים בטקס בנעליים סגורות בלבד ללא סנדלים), גילוח, תספורת תקנית, חיילות יקפידו על שיער אסוף, הופעה במדי א' נקיים ומגוהצים, ענידת סיכות וסמלים ע"פ הזכאות.`,
                    li6: `חל איסור מוחלט להגיע לטקסים ולאירועים בבגדי עבודה (מדי ב').`,
                    li7: `לאירועים נוספים וייחודים, כפי שייקבעו, יפורסמו הנחיות הופעה ולבוש ע"י הח"מ.
                    <br><br><u>הנחיות אלו אינן מבטלות את הוראות קבע אכ"א, אלא מחדדות את הנחיות בדבר הופעתנו בטקסים ובאירועים.</u>`,
                }, ]
            },
        },
    },
    'ערכי צה"ל': {
        "icon": "../assets/images/learning/Artboard 4.svg", // הכנס קישור של אייקון
        // שאלות לנושא הזה
        "questions": [],
        "amountOfQuestions": 2,
        "learningContent": {
            'רוח צה"ל': {
                'מידע אודות רוח צה"ל': [{
                        cardType: "picAndText",
                        title: 'רוח צה"ל',
                        pic: "../assets/images/רוח צהל1.png",
                        content: ""
                    },
                    {
                        cardType: "picAndText",
                        title: 'רוח צה"ל',
                        pic: "../assets/images/רוח צהל2.png",
                        content: ""
                    }
                ]
            },
            'פק"ל יוהל"ם': {
                'מידע אודות פק"ל יוהל"ם': [{
                        cardType: "picAndText",
                        title: 'פק"ל יוהל"ם',
                        pic: "../assets/images/מהות1.png",
                        content: ""
                    },
                    {
                        cardType: "picAndText",
                        title: 'פק"ל יוהל"ם',
                        pic: "../assets/images/מהות2.png",
                        content: ""
                    },
                    {
                        cardType: "picAndText",
                        title: 'פק"ל יוהל"ם',
                        pic: "../assets/images/מהות3.png",
                        content: ""
                    }
                ],

                'לשאלות נוספות ויצירת קשר:': [{
                    cardType: "textThreeParagraphs",
                    text1: `<ol class="list">
                    <b>ממונת היוהל"ם-
                    <br>זהר אסבן 050-966533</b></ol>`,
                    text2: `<ol class="list">
                    מהו"ת-
                    <br>1111 (שלוחה 5 ולאחר מכן, שלוחה 2)
                    <br>וואטסאפ: 052-9282398</ol>`,
                    text3: `<ol class="list">
                    המדור למניעת פגיעה על רקע מיני
                    <br>קו פניות פרט-
                    <br>צהלי: 0302900
                    <br>אזרחי: 03569900</ol>`,
                }, ]
            },
        },
    },
    'תנאי שירות': {
        "icon": "../assets/images/learning/Artboard 4.svg", // הכנס קישור של אייקון
        // שאלות לנושא הזה
        "questions": [],
        "amountOfQuestions": 2,
        "learningContent": {
            'מידע ת"ש': {
                'מידע ת"ש לפק"ל דיגיטלי:': [{
                        cardType: "textTwoParagraphs",
                        text1: `ערוצי הסיוע השונים יינתנו בהתאם למצב הכלכלי או הרפואי של משפחת החייל. לפתיחת אחת הבקשות יש לפנות אל מש"קית הת"ש של סגל הבה"ד.`,
                        text2: `<ol class="list">
                        <u>סיוע כלכלי:</u> תוספת המשכורת או סיוע בתווי קנייה.
                        <br><br><u>תשלומי משפחה:</u> תוספת למשכורת משפחת החייל, בהתאם לגובה ההכנסות ומספר הנפשות במשפחה.
                        <br><br><u>בודד/הלנ"פ:</u> זכאות לפתרון דיור ותוספת במשכורת, עבור חייל שהוריו לא בארץ או שאיננו בקשר עם הוריו.
                        <br><br><u>היתר עבודה פרטית:</u> זכאות לעבודה מחוץ לשעות הפעילות בצבא. עבודה ללא היתר מהווה הפרת פקודה וסיכון בטיחותי!</ol>`,
                    },
                    {
                        cardType: "textTwoParagraphs",
                        text1: `מיוחדות:`,
                        text2: `<ol class="list">
                        <u>כלכלית:</u>
                        על מנת לתת מענה לצורך כלכלי מורכב, ניתן לאפשר לחייל לנצל מיוחדת לפרק זמן מוגבל על מנת לעבוד.
                        <br><br><u>אבל:</u> במקרה של פטירה החייל יהיה זכאי למיוחדת ליום הקבורה וכן לימי השבעה. דרגה ראשונה- שבעה ימים. דרגה שנייה- יומיים.
                        <br><br><u>אשפוז:</u> במקרה של אשפוז קרוב מדרגה ראשונה, ניתן לאפשר לחייל לשהות בביתו וללוות את בן משפחתו על חשבון ימי חופשה מיוחדת.
                        <br><br><u>לימודים:</u> רישום לבחינת בגרות/ תואר/ פסיכומטרי.
                        <br><br> כלל המיוחדות מלבד מיוחדת אבל כפופות באישור מפקדים.
                        <br><br><b>לכל שאלה יש לפנות למש"קית הת"ש של סגל הבה"ד – ענבל אידלסון</b>
                        <br><b>058-430303</b></ol>`,
                    },
                ],
            },
        },
    },
    'דרכי הפנייה למפקד הבה"ד': {
        "icon": "../assets/images/learning/Artboard 4.svg", // הכנס קישור של אייקון
        // שאלות לנושא הזה
        "questions": [],
        "amountOfQuestions": 2,
        "learningContent": {
            'דרכי הפנייה': {
                "הנחיות עבור פניות למפקד:": [{
                    cardType: "listNumbers3",
                    numList: "7",
                    li1: `בכפוף לפ.מ.35.0822, בכל יחידות צה"ל תוצב "תיבת פניות". באמצעותה יוכלו חיילי היחידה לפנות בכתב למפקד הבה"ד, שלא באמצעות מפקדיו הישיר.`,
                    li2: `מיקום התיבה – צמוד לדלת כניסה הראשית של בניין 706.`,
                    li3: `תיבה זו תהיה נעולה באופן קבוע.`,
                    li4: `התיבה תרוקן כל יום בשעה 10:00 ע"י פקידות הלשכה.`,
                    li5: `תוכן התיבה יימסר ישירות למפקד הבה"ד.`,
                    li6: `מפקד הבה"ד יתייחס לפניות שבתיבה, בכל דרך שימצא לנכון, מרגע קבלתן בהתאם לכתוב בפ.מ 35.0822.`,
                    li7: `פניית חייל למפקד דרך תיבת הפניות לא תפגע בזכות החייל לפנות למפקדיו בצינורות הפיקוד המקובלים בהתאם לכתוב בפ.מ 35.0822. `,
                }, {
                    cardType: "picAndText",
                    title: 'חבישת כומתה',
                    content: '',
                    pic: "../assets/images/דרכי פנייה למפקד.jpeg"
                }],
            },
        },
    }
}



/********************************************************************************************************/
/********************************************************************************************************/
/********************************************************************************************************/
/*****  אובייקטים לפי סוג הכרטיסייה המכניסים את התוכן של כל כרטיסייה אל תוך הכרטיסייה  ********/

/**
 * @type {{[index: string]: {init: (card: HTMLElement, json: any) => void}}}
 */
let CARD_TYPES = {};

CARD_TYPES.text = {
    init(card, json) {
        card.querySelector(".content").innerHTML = json.content;
    }
}

CARD_TYPES.textTwoParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
    }
}

CARD_TYPES.textThreeParagraphs = {
    init(card, json) {
        card.querySelector(".text1").innerHTML = json.text1;
        card.querySelector(".text2").innerHTML = json.text2;
        card.querySelector(".text3").innerHTML = json.text3;
    }
}

CARD_TYPES.picAndText = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.twoPics = {
    init(card, json) {
        card.querySelector(".pic1").src = json.pic1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".pic2").src = json.pic2;
        card.querySelector(".content2").innerHTML = json.content2;
    }
}
CARD_TYPES.video = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
    }
}
CARD_TYPES.videoAndText = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
        card.querySelector(".content").innerHTML = json.content;
    }
}
CARD_TYPES.pic_4titles_4text = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
        card.querySelector(".sub-title4").innerHTML = json.subTitle4;
        card.querySelector(".content4").innerHTML = json.content4;
    }
}
CARD_TYPES._3titles_3text = {
    init(card, json) {
        card.querySelector(".sub-title1").innerHTML = json.subTitle1;
        card.querySelector(".content1").innerHTML = json.content1;
        card.querySelector(".sub-title2").innerHTML = json.subTitle2;
        card.querySelector(".content2").innerHTML = json.content2;
        card.querySelector(".sub-title3").innerHTML = json.subTitle3;
        card.querySelector(".content3").innerHTML = json.content3;
    }
}
CARD_TYPES.listDots3 = {
    init(card, json) {
        for (let num = 1; num <= Number(json.numList); num++) {
            card.querySelector(".list").innerHTML += `<li>${json["li"+num]}</li>`;
        }
    }
}
CARD_TYPES.listNumbers3 = {
    init(card, json) {
        for (let num = 1; num <= Number(json.numList); num++) {
            card.querySelector(".list").innerHTML += `<li>${json["li"+num]}</li>`;
        }
    }
}